# CantCopySelectionToNonStory Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CantCopySelectionToNonStory Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't copy this selection to a non-story Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopySelectionToNonStory { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopySelectionToNonStory As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopySelectionToNonStory {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace